Tekla.Structures.Plugins.DirectManipulation.Services.SurfaceType
The Tekla.Structures.Plugins.DirectManipulation.Services.SurfaceType enum defines what the surface represents.

Tekla.Structures.Plugins.DirectManipulation.Services.SurfaceType.GeometryPreview
The surface is a representation of the final result after the modification.
This could be for example one or more surfaces of the solid resulting from the modification.

Tekla.Structures.Plugins.DirectManipulation.Services.SurfaceType.Highlight
The surface is highlighted in the model.